[
    {
        "id": "shineex",
        "workProject": true,
        "name": "Shineex",
        "descEN": "Website online store for the sale of in-game software",
        "descRU": "Сайт интернет-магазин для продажи внутриигрового ПО",
        "desc2EN": "The site was developed from scratch, from design to going into production. Layout design in Figma, layout layout with JSX and CSS, slider layout, backend data retrieval and linking between products. Popup rendering, language change, animation of page appearances and changes. Filtering games by buttons, sorting games by popularity. Also, added custom admin panel via mockAPI.",
        "desc2RU": "Сайт был разработан с нуля, от дизайна до выхода в продакшн. Дизайн макета в Figma, верстка макета с помощью JSX и CSS, верстка слайдера, получение данных с бэкенда и связь между продуктами. Рендеринг всплывающих окон, смена языка, анимация появления и изменения страниц. Фильтрация игр по кнопкам, сортировка игр по популярности. Так-же к этому добавлена некая админ панель через mockAPI.",
        "tech": [
            "HTML",
            "CSS",
            "JavaScript",
            "React",
            "Redux Toolkit",
            "React Redux",
            "Framer Motion",
            "Axios",
            "MUI",
            "i18n",
            "Figma"
        ],
        "linkName": "shineex.xyz",
        "link": "https://shineex.xyz/",
        "timeEN": "1 month",
        "timeRU": "1 месяц",
        "image1": "https://rodya.kz/static/media/shineex.png",
        "image2": "https://rodya.kz/static/media/shineex2.png",
        "image3": "https://rodya.kz/static/media/shineex3.png"
    },
    {
        "id": "brofood",
        "workProject": true,
        "name": "Brofood",
        "descEN": "Website online restaurant",
        "descRU": "Сайт интернет-ресторан",
        "desc2EN": "I was not the only developer on this project. I was engaged in redesign, layout, retrieving and processing data on the frontend of the site. Adding new pages to the project.",
        "desc2RU": "На данном проекте я выполнял роль не единственного разработчика. Занимался редизайном, версткой, получением и обработкой данных на frontend части сайта. Добавлением новых страниц на проект.",
        "tech": [
            "HTML",
            "CSS-module",
            "JavaScript",
            "React",
            "PHP Firebase",
            "i18n",
            "Redux",
            "Redux Thunk",
            "Axios",
            "Figma"
        ],
        "linkName": "brofood.info",
        "link": "https://brofood.info/",
        "timeEN": "1 month",
        "timeRU": "1 месяц",
        "image1": "https://rodya.kz/static/media/brofood.png",
        "image2": "https://rodya.kz/static/media/brofood2.png",
        "image3": "https://rodya.kz/static/media/brofood3.png"
    },
    {
        "id": "bghack",
        "name": "BGHack",
        "workProject": true,
        "descEN": "Website online store for the sale of in-game software",
        "descRU": "Сайт интернет-магазин для продажи внутриигрового ПО",
        "desc2EN": "The site was developed from scratch, from design to going into production. Layout design in Figma, layout layout layout with JSX and CSS, getting data from the backend and linking between products. Pop-up rendering, animation of page appearances and changes. Filtering games by buttons, implementation of game search in catalog. Also, added some admin panel via mockAPI.",
        "desc2RU": "Сайт был разработан с нуля, от дизайна до выхода в продакшн. Дизайн макета в Figma, верстка макета с помощью JSX и CSS, получение данных с бэкенда и связь между продуктами. Рендеринг всплывающих окон, анимация появления и изменения страниц. Фильтрация игр по кнопкам, реализация поиска игры в каталоге. Так-же к этому добавлена некая админ панель через mockAPI.",
        "tech": [
            "HTML",
            "CSS",
            "JavaScript",
            "React",
            "Redux Toolkit",
            "React Redux",
            "Framer Motion",
            "Axios",
            "Lodash",
            "Figma"
        ],
        "linkName": "bghack.xyz",
        "link": "https://bghack.xyz/",
        "timeEN": "1 week",
        "timeRU": "1 неделя",
        "image1": "https://rodya.kz/static/media/bghack.png",
        "image2": "https://rodya.kz/static/media/bghack2.png",
        "image3": "https://rodya.kz/static/media/bghack3.png"
    },
    {
        "id": "techspace",
        "workProject": true,
        "name": "Tech Space",
        "descEN": "The site is an online store for the sale of Apple technology",
        "descRU": "Сайт интернет-магазин для продажи техники Apple",
        "desc2EN": "The site was developed from scratch, from design to going into production. Layout design in Figma, layout layout layout with TSX and CSS, getting data from the backend and linking between products. Pop-up rendering, animation of page appearances and changes. Adding a product to cart, implementation of a game search in the catalog. Also, added some admin panel via mockAPI.",
        "desc2RU": "Сайт был разработан с нуля, от дизайна до выхода в продакшн. Дизайн макета в Figma, верстка макета с помощью TSX и CSS, получение данных с бэкенда и связь между продуктами. Рендеринг всплывающих окон, анимация появления и изменения страниц. Добавление товара в корзину, реализация поиска игры в каталоге.",
        "tech": [
            "HTML",
            "CSS-module",
            "TypeScript",
            "React",
            "Redux Toolkit",
            "React Redux",
            "NodeJS",
            "ExpressJS",
            "Axios",
            "Figma"
        ],
        "linkName": "techspace.com",
        "linkWrong": true,
        "timeEN": "3 weeks",
        "timeRU": "3 недели",
        "image1": "https://rodya.kz/static/media/techspace.png",
        "image2": "https://rodya.kz/static/media/techspace2.png",
        "image3": "https://rodya.kz/static/media/techspace3.png"
    },
    {
        "id": "timer",
        "name": "Simple Timer",
        "workProject": true,
        "descEN": "The purpose of this project is to track the time spent on a task/job",
        "descRU": "Цель данного проекта отслеживание затраченного времени на выполнение задания/работы",
        "desc2EN": "This project was developed on pure React without using any libraries for implementation in any projects of simplecode.kz. There was a creation and addition of a new task, the introduction of time with automatic saving in the history.",
        "desc2RU": "Данный проект разрабатывался на чистом React без использования каких-либо библиотек для внедрения в любые проекты компании simplecode.kz. Было выполнение создание и добавление нового задания, введение времени с автоматическим сохранением в историю.",
        "tech": [
            "HTML",
            "CSS",
            "JavaScript",
            "React"
        ],
        "linkName": "Simple Timer",
        "link": "https://github.com/oldmilky/simple-timer",
        "timeEN": "2 months",
        "timeRU": "2 месяца",
        "image1": "https://rodya.kz/static/media/timer.png",
        "image2": "https://rodya.kz/static/media/timer2.png",
        "image3": "https://rodya.kz/static/media/timer3.png"
    },
    {
        "id": "arayas",
        "name": "Arayas Cheats",
        "workProject": true,
        "descEN": "Website online store for the sale of in-game software",
        "descRU": "Сайт интернет-магазин для продажи внутриигрового ПО",
        "desc2EN": "On this site I was engaged in a project redesign. Changing the design to SCSS, rewriting the logic in NextJS, adding animations appearing and editing.",
        "desc2RU": "На данном сайте я занимался редизайном проекта. Смена дизайна на SCSS, переписывание логики на NextJS, добавление анимаций появления и редактирования.",
        "tech": [
            "HTML",
            "CSS",
            "TypeScript",
            "React",
            "NextJS",
            "Framer Motion",
            "Figma"
        ],
        "linkName": "arayas-cheats.com",
        "link": "https://arayas-cheats.com/",
        "timeEN": "5 days",
        "timeRU": "5 дней",
        "image1": "https://rodya.kz/static/media/arayas.png",
        "image2": "https://rodya.kz/static/media/arayas2.png",
        "image3": "https://rodya.kz/static/media/arayas3.png"
    },
    {
        "id": "qrmenu",
        "workProject": true,
        "name": "QR Menu",
        "descEN": "QR menu site for restaurants",
        "descRU": "Сайт QR меню для ресторанов",
        "desc2EN": "The site was made in pure React and TypeScript. Layout design, layout layout, product linking from backend.",
        "desc2RU": "Сайт был выполнен на чистом React и TypeScript. Дизайн макета, верстка макета, связка товара с бэкендом",
        "tech": [
            "HTML",
            "CSS",
            "TypeScript",
            "React",
            "NodeJS",
            "ExpressJS",
            "Figma"
        ],
        "linkName": "qrmenu",
        "linkWrong": true,
        "timeEN": "5 days",
        "timeRU": "5 дней",
        "image1": "https://rodya.kz/static/media/qrmenu.png",
        "image2": "https://rodya.kz/static/media/qrmenu2.png",
        "image3": "https://rodya.kz/static/media/qrmenu3.png"
    },
    {
        "id": "teamder",
        "learnProject": true,
        "name": "Teamder",
        "descEN": "A unique social network for finding a team, written by me",
        "descRU": "Уникальная соцсеть по поиску команды, написанная мною",
        "desc2EN": "This is where the real crop of functionality is harvested. MUI layout, registration / authorization, changing profile status and description, writing profile posts, validation for errors in all fields, group messenger, getting other users from the backend, viewing other profiles, subscribing to profiles, changing color theme dark / light.",
        "desc2RU": "Здесь собран настоящий урожай из функционала. Верстка с применением библиотеки MUI, регистрация / авторизация, изменение статуса и описания профиля, написание постов в профиле, валидация на ошибки всех полей, групповой мессенджер, получение других пользователей с бэкенда, просмотр других профилей, подписку на профили, смена цветовой темы темная/светлая.",
        "tech": [
            "HTML",
            "CSS",
            "JavaScript",
            "React",
            "Redux OLD",
            "Redux Thunk",
            "React Final Form",
            "Axios",
            "MUI",
            "Figma"
        ],
        "linkName": "teamder",
        "link": "https://github.com/oldmilky/teamder",
        "timeEN": "4 months",
        "timeRU": "4 месяца",
        "image1": "https://rodya.kz/static/media/teamder.png",
        "image2": "https://rodya.kz/static/media/teamder2.png",
        "image3": "https://rodya.kz/static/media/teamder3.png"
    },
    {
        "id": "milky-pizza",
        "learnProject": true,
        "name": "Milky Pizza",
        "descEN": "Site online store selling pizzas from the developer",
        "descRU": "Сайт интернет-магазин по продаже пицц от разработчика",
        "desc2EN": "On this project I am testing new research related to online shopping. Also on this project I am learning TypeScript to this day. Done: layout by layout, getting pizzas from mockAPI backend, size selection, filtering pizzas by category, sorting by popularity and price, searching for pizzas, adding to cart, clearing cart.",
        "desc2RU": "На этом проекте я тестирую новые изучения связанные с интернет-магазинами. Так-же на этом проекте я изучаю TypeScript по сей день. Выполнено: верстка по своему макету, получение пицц с бэкенда mockAPI, выбор размера, фильтрация пицц по категориям, сортировка по популярности и цене, поиск пиццы, добавление в корзину, очищение корзины.",
        "tech": [
            "HTML",
            "CSS",
            "TypeScript",
            "React",
            "Redux Toolkit",
            "Lodash",
            "Axios",
            "Figma"
        ],
        "linkName": "milky pizza",
        "link": "https://github.com/oldmilky/milky-pizza",
        "timeEN": "2 months",
        "timeRU": "2 месяца",
        "image1": "https://rodya.kz/static/media/pizza.png",
        "image2": "https://rodya.kz/static/media/pizza2.png",
        "image3": "https://rodya.kz/static/media/pizza3.png"
    },
    {
        "id": "mesto",
        "learnProject": true,
        "name": "Mesto",
        "descEN": "Social network with photo addition",
        "descRU": "Социальная сеть с добавлением фотографий",
        "desc2EN": "A training project on the course Yandex Practicum. A small social network with registration / authorization, adding new photos, change name and status, change profile avatar, view photos of other users, like photos. Also, there is a BACKEND version of the project, and the version written in plain JavaScript.",
        "desc2RU": "Учебный проект по курсу Яндекс Практикума. Небольшая социальный сеть с регистрацией / авторизацией, добавление новых фотографий, изменение имени и статуса, изменение аватара профиля, просмотр фотографий других пользователей, лайк фотографий. Так-же есть БЭКЕНД версия данного проекта, и версия написанная на обычном JavaScript.",
        "tech": [
            "HTML",
            "CSS",
            "React",
            "NodeJs",
            "ExpressJS",
            "Figma"
        ],
        "linkName": "Mesto",
        "link": "https://github.com/oldmilky/react-mesto-auth",
        "timeEN": "6 months",
        "timeRU": "6 месяцев",
        "image1": "https://rodya.kz/static/media/mesto.png",
        "image2": "https://rodya.kz/static/media/mesto2.png",
        "image3": "https://rodya.kz/static/media/mesto3.png"
    }
]